Revit 2027 API
BuiltInFailures.RebarSystemFailures.DPartReinfDeletedEditDivision Property
 Edits to the model will cause some Reinforcement hosted on Parts to be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DPartReinfDeletedEditDivision { get; }
Public Shared ReadOnly Property DPartReinfDeletedEditDivision As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DPartReinfDeletedEditDivision {
	FailureDefinitionId^ get ();
}
static member DPartReinfDeletedEditDivision : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace